#include <iostream>
// 이미 만들어놓은 함수를 복사.


// 과제
// 메모리의 4영역 조사.
// 컴파일 4단계 조사.

// 앨런 튜닝 : 암호 해독을 위한 계산하는 기계
// 폰 노이만 : 사람의 뇌를 공부해서 컴퓨터를 제작.
// CPU : 논리/연산 장치, 제어 장치
// Memory(RAM - Random Access Memory) : 주기억장치
//	0과 1로 기록.
//   휘발성 저장 : 종료 시 데이터 날라감.
//   물리적 거리 : CPU와 가깝다.
// 
// HDD / SSD : 보조기억장치
//	 반 영구적 저장 : 전원 종료 후에도 데이터가 남아있다.
//   물리적 거리 : CPU보다 멀다. (전원부 옆.)
// 
// 프로세스 : 제작한 프로그램이 메모리에 할당되어 실행되는 것.

using namespace std;
//std의 함수를 바로 쓰겠다.
//구분이 명확하지 않다면 함수 중복으로 모호하다는 에러가 뜸. (어떤 함수를 써야할지 모름)

int main()
{



	cout << "Hello World!" << endl;

	//cout : console out

	return 0;
}